"""
Задача №2. Решение в группах
Планеты вращаются вокруг звезд по эллиптическим орбитам. Назовем самой далекой планетой ту, орбита которой имеет
самую большую площадь. Напишите функцию find_farthest_orbit(list_of_orbits), которая среди списка орбит
планет найдет ту, по которой вращается самая далекая планета. Круговые орбиты не учитывайте: вы знаете, что у
вашей звезды таких планет нет, зато искусственные спутники были были запущены на круговые орбиты. Результатом
функции должен быть кортеж, содержащий длины полуосей эллипса орбиты самой далекой планеты. Каждая орбита
представляет из себя кортеж из пары чисел - полуосей ее эллипса. Площадь эллипса вычисляется по формуле S = pi*a*b,
где a и b - длины полуосей эллипса. При решении задачи используйте списочные выражения. Подсказка: проще всего
будет найти эллипс в два шага: сначала вычислить самую большую площадь эллипса, а затем найти и сам эллипс,
имеющий такую площадь. Гарантируется, что самая далекая планета ровно одна

Ввод:
orbits = [(1, 3), (2.5, 10), (7, 2), (6, 6), (4, 3)]
print(*find_farthest_orbit(orbits))

Вывод:
2.5 10
"""
import math


def find_farthest_orbit(orbits):
    num_pi = math.pi
    get_sq = lambda orbit: num_pi * orbit[0] * orbit[1]  # функция вычисления плозади орбиты планеты
    # возвращаем максимальный объект из списка orbits, исключая тот, где значения кортежа одинаковы
    # максимальный объект, в данном случае, определяется ключевым значением!!!
    return max([orbit for orbit in orbits if orbit[0] != orbit[1]], key=get_sq)


orbits = [(1, 3), (2.5, 10), (7, 2), (6, 6), (4, 3)]
print(*find_farthest_orbit(orbits))
